RIET/src/Documents/PlanningRentalCosts/PlanningRentalCosts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>PlanningRentalCosts</name>
  <registerRecords>InformationRegister.PlanningCosts</registerRecords>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>PlanningCosts</name>
    <attributes>
      <name>Transport</name>
      <type>
        <types>CatalogRef.Transport</types>
      </type>
    </attributes>
    <attributes>
      <name>ServiceProvider</name>
      <type>
        <types>CatalogRef.ServiceProviders</types>
      </type>
    </attributes>
    <attributes>
      <name>Equipment</name>
      <type>
        <types>CatalogRef.Equipments</types>
      </type>
    </attributes>
    <attributes>
      <name>PlanCosts</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>PlanCostsUSD</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/InformationRegisters/TransportAvailabilityStatus/TransportAvailabilityStatus.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>TransportAvailabilityStatus</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Status</name>
    <type>
      <types>EnumRef.TransportAvailabilityStatuses</types>
    </type>
  </resources>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Trip</name>
    <type>
      <types>DocumentRef.TripNonLawsonCompanies</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Transport</name>
    <type>
      <types>CatalogRef.Transport</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/InformationRegisters/TransportMonthlyRate/TransportMonthlyRate.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>TransportMonthlyRate</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>MonthlyRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <dimensions>
    <name>Transport</name>
    <type>
      <types>CatalogRef.Transport</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Enums/TypesOfTransport/TypesOfTransport.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>TypesOfTransport</name>
  <enumValues>
    <name>Own</name>
  </enumValues>
  <enumValues>
    <name>Rental</name>
  </enumValues>
  <enumValues>
    <name>CallOut</name>
  </enumValues>
  <enumValues>
    <name>RentalAutomatic</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Enums/TransportAvailabilityStatuses/TransportAvailabilityStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>TransportAvailabilityStatuses</name>
  <enumValues>
    <name>Available</name>
  </enumValues>
  <enumValues>
    <name>NotAvailable</name>
  </enumValues>
  <enumValues>
    <name>StartRental</name>
  </enumValues>
  <enumValues>
    <name>EndOfRental</name>
  </enumValues>
  <enumValues>
    <name>InRepair</name>
  </enumValues>
  <enumValues>
    <name>Decommission</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Catalogs/Transport/Transport.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Transport</name>
  <predefined>
    <items>
      <name>CallOut</name>
      <description>Call-out transport</description>
    </items>
  </predefined>
  <attributes>
    <name>ServiceProvider</name>
    <type>
      <types>CatalogRef.ServiceProviders</types>
    </type>
  </attributes>
  <attributes>
    <name>Equipment</name>
    <type>
      <types>CatalogRef.Equipments</types>
    </type>
  </attributes>
  <attributes>
    <name>Brand</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MonitoringSystem</name>
    <type>
      <types>CatalogRef.MonitoringSystems</types>
    </type>
  </attributes>
  <attributes>
    <name>TypeOfTransport</name>
    <type>
      <types>EnumRef.TypesOfTransport</types>
    </type>
  </attributes>
  <attributes>
    <name>Site</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>Model</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Tonnage</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SemitrailerPN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьMonthlyRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SemitrailerBrand</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SemitrailerModel</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Geomarket</name>
    <type>
      <types>CatalogRef.GeoMarkets</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ParametersOfMonitoring</name>
    <attributes>
      <name>ParameterIdentifier</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SynonymOfParameter</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ParameterValue</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AddedManually</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>MandatoryField</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/Documents/PlanningRentalCosts/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ЗаполнитьАрендованымТранспортомНаСервере()
	
	Объект.PlanningCosts.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ТранспортноеСредство.Транспорт КАК Транспорт,
	                |	ТранспортноеСредство.ServiceProvider КАК ServiceProvider,
	                |	ТранспортноеСредство.Equipment КАК Equipment,
	                |	TransportAvailabilityStatusСрезПоследних.Status КАК Status,
	                |	TransportMonthlyRateСрезПоследних.MonthlyRate КАК MonthlyRate,
	                |	TransportMonthlyRateСрезПоследних.Currency КАК Currency
	                |ИЗ
	                |	(ВЫБРАТЬ
	                |		Transport.Ссылка КАК Транспорт,
	                |		Transport.ServiceProvider КАК ServiceProvider,
	                |		Transport.Equipment КАК Equipment
	                |	ИЗ
	                |		Справочник.Transport КАК Transport
	                |	ГДЕ
	                |		Transport.TypeOfTransport = ЗНАЧЕНИЕ(Перечисление.TypesOfTransport.Rental)) КАК ТранспортноеСредство
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.TransportAvailabilityStatus.СрезПоследних(&Дата, Status <> ЗНАЧЕНИЕ(Перечисление.TransportAvailabilityStatuses.EndOfRental)) КАК TransportAvailabilityStatusСрезПоследних
	                |		ПО ТранспортноеСредство.Транспорт = TransportAvailabilityStatusСрезПоследних.Transport
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.TransportMonthlyRate.СрезПоследних(&Дата, ) КАК TransportMonthlyRateСрезПоследних
	                |		ПО ТранспортноеСредство.Транспорт = TransportMonthlyRateСрезПоследних.Transport";
	Запрос.УстановитьПараметр("Дата", КонецМесяца(Объект.Дата));
		
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		
		СтрокаТЧ = Объект.PlanningCosts.Добавить();
		СтрокаТЧ.Transport = Результат.Транспорт;
		СтрокаТЧ.ServiceProvider = Результат.ServiceProvider;
		СтрокаТЧ.Equipment = Результат.Equipment;
		СтрокаТЧ.PlanCosts = Результат.MonthlyRate;
		СтрокаТЧ.Currency = Результат.Currency;
		CostsSumUSD = 0;
		Если Результат.MonthlyRate <> 0 И ЗначениеЗаполнено(Результат.Currency) Тогда
			CostsSumUSD = LocalDistributionForNonLawsonСервер.ПолучитьCostsSumSLBUSD(Результат.MonthlyRate, Результат.Currency, Объект.Дата);
		КонецЕсли;
		СтрокаТЧ.PlanCostsUSD = CostsSumUSD;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАрендованымТранспортом(Команда)
	ЗаполнитьАрендованымТранспортомНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура PlaningCostsPlanCostПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.PlaningCosts.ТекущиеДанные;
	Если ТекущиеДанные.PlanCosts <> 0 И ЗначениеЗаполнено(ТекущиеДанные.Currency) Тогда
		CostsSumUSD = LocalDistributionForNonLawsonСервер.ПолучитьCostsSumSLBUSD(ТекущиеДанные.PlanCosts, ТекущиеДанные.Currency, Объект.Дата);
		ТекущиеДанные.PlanCostsUSD = CostsSumUSD;	
	КонецЕсли;	
	
КонецПроцедуры
